dynamicMeshWakeGenerator/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                |
| \\      /  F ield         | cfMesh: A library for mesh generation          | 
|  \\    /   O peration     |                                                |
|   \\  /    A nd           | Author: Franjo Juretic                         | 
|    \\/     M anipulation  | E-mail: franjo.juretic@c-fields.com            |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version   2.0;
    format    ascii;
    class     dictionary;
    location  "system";
    object    meshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile "constant/triSurface/WakeGenerator_SW.fms";

maxCellSize 0.005;

//boundaryLayers
//{
//    patchBoundaryLayers
//    {
//        WakeGenerator
//        {
//            nLayers 5;
//            thicknessRatio 1.15;
//        }
//    }
//}

// ************************************************************************* //
